# IFCHybrid Import Options Create Method

Source: https://www.revitapidocs.com/2026/9f65726a-8aea-cbd3-4884-752c73d318e9.htm

---

| IFCHybrid Import Options Create Method |
| --- |

Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCHybridImportOptions Create(
	string optionString
)
```

```
Public Shared Function Create (
	optionString As String
) As IFCHybridImportOptions
```

```
public:
static IFCHybridImportOptions^ Create(
	String^ optionString
)
```

```
static member Create :
        optionString : string -> IFCHybridImportOptions
```

#### Parameters

optionString String
:   The options string.

#### Return Value

IFCHybridImportOptions
The IFCHybridImportOptions, or null. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace